Repository: omtejeda/notification-api
Catalog: src/NotificationService.SharedKernel/Resources/Messages.*.resx
Languages: es

# ApiKeyNotProvided
source: Api key was not provided
es: No se proporcionó api key

# ApiKeyNotValid
source: Api key provided is not valid
es: Api key proporcionado no es válido

# ApiKeyNotActive
source: Api key provided belongs to a platform which is not active
es: Api key proporcionado corresponde a una plataforma inactiva

# AttachmentIsRequired
source: Must specify at least one attachment
es: Debe especificar al menos un attachment

# NotificationNotExists
source: Notification does not exist
es: Notification no existe

# NotificationWasNotCreatedByYou
source: Notification was not created by {0}
es: Notification no fue creada por {0}

# NotificationRequestNotFound
source: Notification request could not be found
es: Notification request no fue encontrada

source: Template already exists
es: Template ya existe

# TemplateTryingToDeleteNotExists
source: Template you're trying to delete does not exist
es: Template que intenta eliminar no existe

# TemplateNotExists
source: Template does not exist
es: Template no existe

# TemplateNotBelongsToYou
source: Template does not belong to your platform!
es: Template no corresponde a esta plataforma

# TemplateWithNoContent
source: Template does not have content
es: Template no posee contenido

# TemplateContentNotValid
source: Content provided not valid
es: Contenido proporcionado no es válido

# TemplateWasNotCreatedByYou
source: Template was not created by {0}
es: Template no fue creado por {0}

# NotificationTypeNotValid
source: Notification type {0} not valid
es: Tipo de notification {0} no es válido

# CatalogSpecifiedNotExists
source: Catalog [{0}] does not exist
es: Catalogo {0} no existe

# CatalogSpecifiedNotHaveGivenKey
source: Catalog [{0}] does not have key: [{1}]
es: Catalogo {0} no posee key: {1}

# CatalogAlreadyExists
source: "There is already a catalog named [{0}], created by {1}
es: "Ya existe un catalogo con el nombre [{0}], creado por {1}

# CatalogWithGivenIdNotExists
source: Does not exist a catalog with ID [{0}]
es: No existe catalogo con ID [{0}]

# CatalogWasNotCreatedByYou
source: Catalog was not created by {0}
es: Catalogo no fue creado por {0}

# TemplateSpecifiedNotCorrespondToGivenNotificationType
source: Template specified does not correspond to {0}. It corresponds to {1}
es: Template especificado no corresponde a {0}. Corresponde a {1}

# ProviderWasNotCreatedByYou
source: Provider was not created by {0}
es: Provider no fue creado por {0}

# ProviderWithGivenIdNotExists
source: Does not exist a provider with ID [{0}]
es: No existe provider con ID [{0}]

# ProviderSpecifiedNotExists
source: Provider {0} does not exist
es: Provider {0} no existe

# ProviderIsNotPublicNeitherWasCreatedByYou
source: Provider was not created by {0} and is not public
es: Provider no fue creado por {0} y tampoco es público

# ProviderSpecifiedNotSuitable
source: No suitable provider found to perform this action. Current: {0}
es: No se encontró provider adecuado para esta acción. Proporcionado: {0}

# ProviderTypeNotValid
source: Provider type [{0}] not valid
es: Tipo de provider {0} no es válido

# ProviderAlreadyExists
source: Provider with name [{0}] already exists. Created by {1}"
es: Provider {0} ya existe. Creado por {1}"

# NotificationTypeSpecifiedNotAllowed
source: Notification type not allowed {0}
es: Tipo de Notification no permitido {0}

# AttachmentNotFound
source: Attachment: {0} not found"
es: Adjunto: {0} no encontrado"

# PlatformAlreadyExists
source: There is already a platform named [{0}], created by {1}
es: Ya existe plataforma {0} creada por {1}

# PlatformWithGivenIdNotExists
source: Does not exist a platform with ID [{0}]
es: No existe plataforma con ID {0}

# PlatformWasNotCreatedByYou
source: Platform was not created by {0}
es: Platform no fue creada por {0}

# RequiredValue
source: A value for {0} is required
es: Se requiere especificar valor para {0}

# ValueNotValid
source: "Value not valid {0}"
es: "Valor no válido para {0}"

# HttpVerbNotAllowed
source: HTTP verb: {0} not allowed
es: Verbo HTTP: {0} no permitido

# MetadataRequiredByProvider
source: Provider require this metadata [{0}] to be specified.
es: Provider requiere que se especifique esta metadata: [{0}]

# RecipientNotExists
source: Does not exist recipient: {0}
es: No existe destinatario: {0}

source: Recipient already exists
es: Destinatario ya existe

# ProviderSettingsConflict
source: Provider specified {0} - no need to provide settings for another provider type!
es: Provider especificado {0} - no se requiere especificar la configuracion de otro tipo de provider!
